import React from 'react';

function Faculty({ faculty, onChange }) {
    const faculties = ["Факультет компьютерных наук",
        "Медико-биологический факультет",
        "Факультет географии, геоэкологии и туризма",
        "Геологический факультет",
        "Факультет журналистики",
        "Исторический факультет",
        "Математический факультет",
        "Факультет международных отношений",
        "Факультет прикладной математики, информатики и механики",
        "Факультет романо-германской филологии",
        "Химический факультет",
        "Фармацевтический факультет",
        "Физический факультет",
        "Филологический факультет",
        "Факультет философии и психологии",
        "Экономический факультет",
        "Юридический факультет"];

    return (
        <div>
            <label className="light">Выберите факультет, на котором велась разработка программы для ЭВМ или базы данных</label>
            <select required value={faculty} onChange={onChange}>
                <option value="" disabled>Выберите факультет</option>
                {faculties.map((facultyOption, index) => (
                    <option key={index} value={facultyOption}>
                        {facultyOption}
                    </option>
                ))}
            </select>
        </div>
    );
}

export default Faculty;